fixture/custom_cassettes/payment/full_refund.json

[
  {
    "request": {
      "body": "",
      "headers": {
        "User-Agent": "Razorpay-Elixir/0.1.0"
      },
      "method": "post",
      "options": {
        "basic_auth": [
          "key_id",
          "key_secret"
        ]
      },
      "request_body": "",
      "url": "https://api.razorpay.com/v1/payments/fake_payment_id/refund"
    },
    "response": {
      "body": "{\"id\":\"rfnd_6A2Fz5bOlAZ4wF\",\"entity\":\"refund\",\"amount\":5000,\"currency\":\"INR\",\"payment_id\":\"fake_payment_id\",\"notes\":[],\"created_at\":1471948271}",
      "headers": {
        "Cache-Control": "max-age=0, must-revalidate, no-store, nocache, private",
        "Content-Type": "application/json",
        "Date": "Tue, 23 Aug 2016 10:31:11 GMT",
        "Expires": "Fri, 01 Jan 1990 00:00:00 GMT",
        "Pragma": "no-cache",
        "Server": "Apache",
        "Strict-Transport-Security": "max-age=63072000; includeSubDomains",
        "X-Frame-Options": "SAMEORIGIN",
        "Content-Length": "146",
        "Connection": "keep-alive"
      },
      "status_code": 200,
      "type": "ok"
    }
  }
]