fixture/vcr_cassettes/payment/all_payments.json

[
  {
    "request": {
      "body": "",
      "headers": {
        "User-Agent": "Razorpay-Elixir/0.1.0"
      },
      "method": "get",
      "options": {
        "basic_auth": [
          "key_id",
          "key_secret"
        ]
      },
      "request_body": "",
      "url": "https://api.razorpay.com/v1/payments"
    },
    "response": {
      "body": "{\"entity\":\"collection\",\"count\":2,\"items\":[{\"id\":\"fake_id1\",\"entity\":\"payment\",\"amount\":5000,\"currency\":\"INR\",\"status\":\"failed\",\"order_id\":null,\"method\":\"netbanking\",\"amount_refunded\":0,\"refund_status\":null,\"captured\":false,\"description\":\"Purchase Description\",\"card_id\":null,\"bank\":\"HDFC\",\"wallet\":null,\"email\":\"support@razorpay.com\",\"contact\":\"+919123456789\",\"notes\":[],\"fee\":0,\"service_tax\":0,\"error_code\":\"BAD_REQUEST_ERROR\",\"error_description\":\"Payment failed\",\"created_at\":1471720420},{\"id\":\"fake_id2\",\"entity\":\"payment\",\"amount\":5000,\"currency\":\"INR\",\"status\":\"captured\",\"order_id\":null,\"method\":\"netbanking\",\"amount_refunded\":4850,\"refund_status\":\"partial\",\"captured\":true,\"description\":\"Purchase Description\",\"card_id\":null,\"bank\":\"HDFC\",\"wallet\":null,\"email\":\"support@razorpay.com\",\"contact\":\"+919123456789\",\"notes\":[],\"fee\":144,\"service_tax\":19,\"error_code\":null,\"error_description\":null,\"created_at\":1471720235}]}",
      "headers": {
        "Cache-Control": "max-age=0, must-revalidate, no-store, nocache, private",
        "Content-Type": "application/json",
        "Date": "Tue, 23 Aug 2016 08:18:02 GMT",
        "Expires": "Fri, 01 Jan 1990 00:00:00 GMT",
        "Pragma": "no-cache",
        "Server": "Apache",
        "Strict-Transport-Security": "max-age=63072000; includeSubDomains",
        "X-Frame-Options": "SAMEORIGIN",
        "Content-Length": "944",
        "Connection": "keep-alive"
      },
      "status_code": 200,
      "type": "ok"
    }
  }
]
